In [1]:
import pandas as pd

df = pd.DataFrame({
    'name': ['Alice', 'Bob'],
    'math': [90, 80],
    'science': [85, 75],
    'history': [35, 20],    
})

df

    name  math  science  history
0  Alice    90       85       35
1    Bob    80       75       20

In [2]:
melted = pd.melt(df, id_vars='name')
melted

    name variable  value
0  Alice     math     90
1    Bob     math     80
2  Alice  science     85
3    Bob  science     75
4  Alice  history     35
5    Bob  history     20

In [3]:
melted = pd.melt(df, id_vars='name', value_vars=['math', 'history'])
melted

    name variable  value
0  Alice     math     90
1    Bob     math     80
2  Alice  history     35
3    Bob  history     20